src/Reports/ПечатнаяФормаПриостановлениеТрудовогоДоговора/ПечатнаяФормаПриостановлениеТрудовогоДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПечатнаяФормаПриостановлениеТрудовогоДоговора</name>
</mdclass:Report>

src/Catalogs/ОснованияПриостановленияТрудовыхДоговоровКонтрактов/ОснованияПриостановленияТрудовыхДоговоровКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОснованияПриостановленияТрудовыхДоговоровКонтрактов</name>
  <predefined>
    <items>
      <name>Возврат3484</name>
      <description>348.4 (Возврат)</description>
    </items>
    <items>
      <name>Перевод3484</name>
      <description>348.4 (Перевод)</description>
    </items>
    <items>
      <name>Контракт3517</name>
      <description>351.7 (Контракт)</description>
    </items>
    <items>
      <name>Мобилизация3517</name>
      <description>351.7 (Мобилизация)</description>
    </items>
    <items>
      <name>Содействие3517</name>
      <description>351.7 (Содействие)</description>
    </items>
    <items>
      <name>Контракт531</name>
      <description>53.1 (Контракт)</description>
    </items>
    <items>
      <name>Мобилизация531</name>
      <description>53.1 (Мобилизация)</description>
    </items>
    <items>
      <name>Содействие531</name>
      <description>53.1 (Содействие)</description>
    </items>
  </predefined>
  <attributes>
    <name>ТекстОснования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Часть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пункт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подпункт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>EnumRef.НормативныеДокументыОснованийКадровыхПриказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Абзац</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/ПечатнаяФормаПриостановлениеТрудовогоДоговора/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказМобилизация");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с мобилизацией';
										|en = 'Order to suspend the employment contract due to mobilization'");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказКонтракт");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с контрактом';
										|en = 'Order to suspend the employment contract due to the service contract'");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказСодействие");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с контрактом о добровольном содействии';
										|en = 'Order to suspend the employment contract due to the contract on voluntary assistance'");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказГражданскиеСлужащиеМобилизация");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с мобилизацией';
										|en = 'Order to suspend the employment contract with a public service employee due to mobilization'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьГосударственнуюСлужбу");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказГражданскиеСлужащиеКонтракт");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с контрактом';
										|en = 'Order to suspend the contract with a public service employee due to the service contract'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьГосударственнуюСлужбу");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПриказГражданскиеСлужащиеСодействие");
	НастройкиВарианта.Описание = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с контрактом о добровольном содействии';
										|en = 'Order to suspend the employment contract with a public service employee due to the contract on voluntary assistance'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьГосударственнуюСлужбу");
	НастройкиВарианта.Включен = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКомандыПечатиПечатныхФормОтчета(КомандыПечати) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.ПечатнаяФормаПриостановлениеТрудовогоДоговора) Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеМобилизация";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении в связи с мобилизацией';
											|en = 'Order on the suspension due to mobilization'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Мобилизация3517);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеКонтракт";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с контрактом';
											|en = 'Order to suspend the employment contract due to the service contract'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Контракт3517);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеСодействие";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении трудового договора в связи с контрактом о добровольном содействии';
											|en = 'Order to suspend the employment contract due to the contract on voluntary assistance'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Содействие3517);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеГражданскиеСлужащиеМобилизация";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с мобилизацией';
											|en = 'Order to suspend the employment contract with a public service employee due to mobilization'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ФункциональныеОпции = "ИспользоватьГосударственнуюСлужбу";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Мобилизация531);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеГражданскиеСлужащиеКонтракт";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с контрактом';
											|en = 'Order to suspend the contract with a public service employee due to the service contract'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ФункциональныеОпции = "ИспользоватьГосударственнуюСлужбу";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Контракт531);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПриостановлениеГражданскиеСлужащиеСодействие";
		КомандаПечати.Порядок = 10;
		КомандаПечати.Представление = НСтр("ru = 'Приказ о приостановлении контракта с гражданским служащим в связи с контрактом о добровольном содействии';
											|en = 'Order to suspend the employment contract with a public service employee due to the contract on voluntary assistance'");
		КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ФункциональныеОпции = "ИспользоватьГосударственнуюСлужбу";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати,
			"ОснованиеПриостановления", Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Содействие531);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ЗарплатаКадрыОтчеты.ВывестиВКоллекциюПечатнуюФорму("Отчет.ПечатнаяФормаПриостановлениеТрудовогоДоговора",
		МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

Процедура Сформировать(ДокументРезультат, РезультатКомпоновки, ОбъектыПечати = Неопределено, ПараметрыПечати = Неопределено) Экспорт
	
	Если РезультатКомпоновки.ОтчетПустой Тогда
		Возврат;
	КонецЕсли;
	
	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_" + РезультатКомпоновки.ИдентификаторыМакета;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Организации = Новый Массив;
	Для Каждого ДанныеНаПечать Из РезультатКомпоновки.ДанныеОтчета.Строки Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Организации, ДанныеНаПечать.Строки.ВыгрузитьКолонку("РаботаОрганизация"), Истина);
	КонецЦикла;
	
	АдресаОрганизаций = УправлениеКонтактнойИнформациейЗарплатаКадры.АдресаОрганизаций(Организации);
	Для Каждого ДанныеНаПечать Из РезультатКомпоновки.ДанныеОтчета.Строки Цикл
		
		ПерваяСтрокаПечатнойФормы = ДокументРезультат.ВысотаТаблицы + 1;
		
		Для Каждого ДанныеДетальныхЗаписей Из ДанныеНаПечать.Строки Цикл
			
			НомерСтрокиНачалаОбласти = ДокументРезультат.ВысотаТаблицы + 1;
			
			ДанныеПолучаемыеНаХоду= Новый Структура;
			ОписаниеФактическогоАдреса = УправлениеКонтактнойИнформациейЗарплатаКадры.АдресОрганизации(
				АдресаОрганизаций,
				ДанныеДетальныхЗаписей.РаботаОрганизация,
				Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			ДанныеПолучаемыеНаХоду.Вставить("РаботаОрганизацияГородФактическогоАдреса", ОписаниеФактическогоАдреса.Город);
			
			Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ДанныеПользовательскихПолей = ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(РезультатКомпоновки.ИдентификаторыМакета, ДанныеДетальныхЗаписей);
			
			ЗарплатаКадрыОтчеты.ВывестиВДокументРезультатОбластиМакета(
				ДокументРезультат, РезультатКомпоновки.МакетПечатнойФормы, "Бланк",
				ДанныеНаПечать,
				ДанныеДетальныхЗаписей,
				ДанныеПользовательскихПолей,
				ДанныеПолучаемыеНаХоду);
			
			КадровыйЭДО.ЗадатьДетальнуюОбластьПечати(ПараметрыПечати, ДокументРезультат, РезультатКомпоновки.ИдентификаторыМакета, НомерСтрокиНачалаОбласти,
				ДанныеДетальныхЗаписей, ДанныеНаПечать.СсылкаНаОбъект);
			
		КонецЦикла;
		
		Если ОбъектыПечати <> Неопределено Тогда
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, ПерваяСтрокаПечатнойФормы, ОбъектыПечати, ДанныеНаПечать.СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
